
AUDIO MODEL:
_____________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_2 (InputLayer)         (None, 1, 48000)          0
_____________________________________________________________
spectrogram_1 (Spectrogram)  (None, 257, 197, 1)       263168
_____________________________________________________________
lambda_1 (Lambda)            (None, 257, 197, 1)       0
_____________________________________________________________
conv2d_8 (Conv2D)            (None, 257, 197, 64)      640
_____________________________________________________________
batch_normalization_9 (Batch (None, 257, 197, 64)      256
_____________________________________________________________
activation_9 (Activation)    (None, 257, 197, 64)      0
_____________________________________________________________
conv2d_9 (Conv2D)            (None, 257, 197, 64)      36928
_____________________________________________________________
batch_normalization_10 (Batc (None, 257, 197, 64)      256
_____________________________________________________________
activation_10 (Activation)   (None, 257, 197, 64)      0
_____________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 128, 98, 64)       0
_____________________________________________________________
conv2d_10 (Conv2D)           (None, 128, 98, 128)      73856
_____________________________________________________________
batch_normalization_11 (Batc (None, 128, 98, 128)      512
_____________________________________________________________
activation_11 (Activation)   (None, 128, 98, 128)      0
_____________________________________________________________
conv2d_11 (Conv2D)           (None, 128, 98, 128)      147584
_____________________________________________________________
batch_normalization_12 (Batc (None, 128, 98, 128)      512
_____________________________________________________________
activation_12 (Activation)   (None, 128, 98, 128)      0
_____________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 64, 49, 128)       0
_____________________________________________________________
conv2d_12 (Conv2D)           (None, 64, 49, 256)       295168
_____________________________________________________________
batch_normalization_13 (Batc (None, 64, 49, 256)       1024
_____________________________________________________________
activation_13 (Activation)   (None, 64, 49, 256)       0
_____________________________________________________________
conv2d_13 (Conv2D)           (None, 64, 49, 256)       590080
_____________________________________________________________
batch_normalization_14 (Batc (None, 64, 49, 256)       1024
_____________________________________________________________
activation_14 (Activation)   (None, 64, 49, 256)       0
_____________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 32, 24, 256)       0
_____________________________________________________________
conv2d_14 (Conv2D)           (None, 32, 24, 512)       1180160
_____________________________________________________________
batch_normalization_15 (Batc (None, 32, 24, 512)       2048
_____________________________________________________________
activation_15 (Activation)   (None, 32, 24, 512)       0
_____________________________________________________________
audio_embedding_layer (Conv2 (None, 32, 24, 512)       2359808
_____________________________________________________________
batch_normalization_16 (Batc (None, 32, 24, 512)       2048
_____________________________________________________________
activation_16 (Activation)   (None, 32, 24, 512)       0
_____________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 1, 1, 512)         0
_____________________________________________________________
flatten_2 (Flatten)
   (None, 512)               0
=================================================================
Total params: 4,955,072
Trainable params: 4,688,064
Non-trainable params: 267,008
_____________________________________________________________


VISION MODEL:
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 224, 224, 64)      1792
_________________________________________________________________
batch_normalization_1 (Batch (None, 224, 224, 64)      256
_________________________________________________________________
activation_1 (Activation)    (None, 224, 224, 64)      0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 224, 224, 64)      36928
_________________________________________________________________
activation_2 (Activation)    (None, 224, 224, 64)      0
_________________________________________________________________
batch_normalization_2 (Batch (None, 224, 224, 64)      256
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 112, 112, 64)      0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 112, 112, 128)     73856
_________________________________________________________________
batch_normalization_3 (Batch (None, 112, 112, 128)     512
_________________________________________________________________
activation_3 (Activation)    (None, 112, 112, 128)     0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 112, 112, 128)     147584
_________________________________________________________________
batch_normalization_4 (Batch (None, 112, 112, 128)     512
_________________________________________________________________
activation_4 (Activation)    (None, 112, 112, 128)     0
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 56, 56, 128)       0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 56, 56, 256)       295168
_________________________________________________________________
batch_normalization_5 (Batch (None, 56, 56, 256)       1024
_________________________________________________________________
activation_5 (Activation)    (None, 56, 56, 256)       0
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 56, 56, 256)       590080
_________________________________________________________________
batch_normalization_6 (Batch (None, 56, 56, 256)       1024
_________________________________________________________________
activation_6 (Activation)    (None, 56, 56, 256)       0
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 28, 28, 256)       0
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 28, 28, 512)       1180160
_________________________________________________________________
batch_normalization_7 (Batch (None, 28, 28, 512)       2048
_________________________________________________________________
activation_7 (Activation)    (None, 28, 28, 512)       0
_________________________________________________________________
vision_embedding_layer (Conv (None, 28, 28, 512)       2359808
_________________________________________________________________
batch_normalization_8 (Batch (None, 28, 28, 512)       2048
_________________________________________________________________
activation_8 (Activation)    (None, 28, 28, 512)       0
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 1, 1, 512)         0
_________________________________________________________________
flatten_1 (Flatten)          (None, 512)               0
=================================================================
Total params: 4,693,056
Trainable params: 4,689,216
Non-trainable params: 3,840
_________________________________________________________________